[
    {
        "breed": "Bulldog",
        "image": "../img/wikiDogs/bulldog.jpg",
        "fun_facts": "<ul><li>Bulldogs have broken world records!! In 2015, a dog named Otto set a record for “the world record for the longest human tunnel traveled through by a skateboarding dog”. Otto had skated under 30 people!  Thats quite a record to beat, another fun fact is that Otto’s owner was inspired  to get a Bulldog after seeing another Bulldog world record of Tillman who was the fastest dog skate boarder.</li><li>During World War II, the British referred to the Bulldog as “The Churchill Dog.” Apparently, Prime Minister Winston Churchill and the English Bulldog both symbolized the courage and strength of England. Churchill himself actually didn’t own any Bulldogs, though – he preferred Poodles.</li><li>Of course, not all dog breeds are made to be Olympic-level swimmers, but if you put a Bulldog in the water without a doggie life jacket, he will be in some trouble. Even though he is only 16 inches tall, he can weigh 50 pounds. Their short legs and small hindquarters aren’t equipped to keep their dense body afloat and his large head above the water.</li></ul>",
        "general_care": "<ul><li>As with most dog breeds, it’s appropriate to feed an adult Bulldogs twice a day, in morning and evening. English Bulldog puppies need to eat more frequently (about three or four times daily).</li><li>Some English Bulldogs may require a slow feeder bowl so they don’t eat too quickly, which can result in regurgitation or aspiration pneumonia.</li><li>Despite their reputation for being lazy, Bulldogs benefit from daily exercise. They typically don’t need a significant amount of exercise, but it can be helpful—especially in those that are overweight.</li><li>English Bulldogs are not well-adapted to hot climates. When it’s hot, ensure your Bulldog has access to shade, water, and AC at all times, and restrict any neighborhood walks to cooler times of the day (morning and evening).</li></li>Their short snouts also mean this breed is not known for being particularly quiet—there’s lots of panting, snorting, and snoring. Their wrinkly skin will also require frequent maintenance to prevent skin infections.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.akc.org/expert-advice/lifestyle/9-things-you-didnt-know-about-the-bulldog/'>ACK - 9 Things You May Not Know About Bulldogs</a> <br> <a href='https://www.petmd.com/dog/breeds/bulldog'>PetMD - Bulldog</a>.</p>"
    },
    {
        "breed": "Poodle",
        "image": "../img/wikiDogs/poodle.jpg",
        "fun_facts": "<ul><li>Poodles are officially ranked as the second most intelligent dog breed, but any poodle owner knows they are truly number one. While border collies are clever and cute with their tricks, poodles show their superior intelligence in everyday life. They can learn many tricks, from walking on two paws to jumping through hoops, and are very observant of their human companions, often behaving like us. Their intelligence and athleticism make them popular in circuses and shows.</li><li>The AKC (American Kennel Club) and the Kennel Club UK both categorize Poodles into three official categories: Standard, Miniature, and Toy. However in the EU, International Poodle Standard (FCI) recognize a size in between the Miniature and the Standard Poodle called the Moyen poodle. The AKC describes the Standard Poodle as “among dogdom’s true aristocrats”. Poodle coats are hypoallergenic, and naturally curly but with regular grooming and brushing can have an elegant look for a night on the town. Typical colors are black, white, brown, red, parti, grey, blue, silver and apricot.</li><li>Regardless of how long and fluffy their hair is, it will keep growing. Every poodle owner knows they need regular grooming to manage their hair. This means daily brushing and regular baths to keep their skin clean. You don’t want your poodle’s hair to get matted, as it will be hard to control and embarrassing for both you and your dog. Poodle owners often notice their dogs staring at themselves in the mirror after being freshly groomed. This shows their intelligence and self-awareness. If you own a poodle, show them respect, and they will return the favor.</li></ul>",
        "general_care": "<ul><li>Poodles have a naturally curly, thick coat that can look and feel like lamb’s wool. It requires lots of grooming and coats should be brushed every day to avoid tangles, knots and matting.</li><li>Poodles are a hardy breed, but Standard Poodles can be prone to bloating so smaller, more frequent meals are often recommended. Consult your vet for advice on meal frequency and amounts.</li><li>Ideally, you should feed your adult Poodle twice a day to spread their daily calorie intake across both meals.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.lucypetproducts.com/blog/10-interesting-facts-about-poodles/'>LUCY Pet - 10 Interesting Facts About Poodles</a> <br> <a href='https://www.petplan.co.uk/pet-information/dog/breed/poodle/'>Petplan - Poodle</a>.</p>"
    },
    {
        "breed": "Shih Tzu",
        "image": "../img/wikiDogs/shihtzu.jpg",
        "fun_facts": "<ul><li>The Shih Tzu breed dates back to well over 1,000 years, making it one of the oldest documented dog breeds in the world. As early as 1000 BCE, small dogs known as “under the table” dogs existed in China, and they were considered the predecessors to the Shih Tzu.</li><li>Many dog breeds were developed to perform specific tasks, but the Shih Tzu had a simpler role: providing companionship. They were especially cherished by Chinese royalty, offering warmth by sleeping on their masters' feet, napping in beds to preheat them, and being carried around in women's robes. Above all, the Shih Tzu was valued for its affectionate personality and loyalty.</li><li>During the Communist Revolution in China, the Shih Tzu was almost wiped out due to their association with wealth and royalty. The breed also faced challenges when Dowager Empress Tzu Hsi, who had supervised a breeding program for multiple breeds including the Shih Tzu, Pug, and Pekingese, passed away in 1908. Despite these setbacks, a few Shih Tzus survived and were used in a new breeding program in the early 20th century. Today, all purebred Shih Tzus are believed to trace their lineage back to just 14 dogs that helped redevelop the breed.</li></ul>",
        "general_care": "<ul><li>It’s important to pay attention to the ingredients of everything that comes into contact with a Shih Tzu’s skin or coat, including shampoo, wash-out conditioner, and leave-in spray. Avoid artificial fragrances or dyes, and soaping agents including sulfates all of which can be harsh on skin and/or cause allergies. Also steer clear of parabens and phthalates which are linked to hormonal disruptions and other health issues. Anything with a pH balance below 6.5 or over 7.5 should not be used.</li><li>Collars, which cause pressure to be directed onto the windpipe, should be avoided. This is because the Shih Tzu is a toy breed (prone to collapsed trachea) and a brachycephalic breed (prone to breathing issues). An easy and comfortable alternative to a collar is a harness, which distributes pressure over the back, shoulders, and chest which are stronger, more muscled areas.</li><li>If you have to leave your Shih Tzu home alone and they have a hard time coping with the isolation, you are not alone. This is referred to as separation anxiety, and it’s a very common issue seen with dogs, including the Shih Tzu breed.  Signs include anxious behaviors such as whining or pacing (in anticipation or while alone), housebreaking accidents, excessive barking, excessive drooling, depressed behavior, and/or destructive chewing. There are things you can do to help, including setting up a ‘den-like’ area, offering toys that can keep a dog occupied, playing calming music, and using behavioral companion toys.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.dogster.com/lifestyle/facts-about-shih-tzu'>Dogster - 12 Interesting Facts About the Shih Tzu</a> <br> <a href='https://www.allshihtzu.com/shih-tzu-care'>AllShihTzu - Shih Tzu Care Tips</a>.</p>"
    },
    {
        "breed": "Borzoi",
        "image": "../img/wikiDogs/borzoi.jpg",
        "fun_facts": "<ul><li>The Borzoi, known as the Russian wolfhound until 1936, is a sighthound. These hounds were bred to hunt wolves, small animals, and other prey. Consequently, even in pet capacity, they are prone to chase anything that moves thanks to their wolf hunting background.</li><li>Bred for speed, a Borzoi can reach speeds of 35-40 miles per hour on the run. Their looks are reminiscent of the Arabian greyhound and their speed makes them ideal hunting dogs.</li><li>The Borzoi is a relatively quiet dog and is not prone to much barking. With an independent personality and the occasional stubborn streak characteristic of the breed, it has often been described as having a cat-like temperament. Early socialization and obedience training is important and can help these dogs learn how to best behave with their families.</li></ul>",
        "general_care": "<ul><li>Borzois are surprisingly small eaters for their size and only eat about the same amount of food as a medium-sized dog. As well as being fed a high quality balanced diet, a Borzoi enjoys chewing large bones, particularly when left alone for periods of time. The Borzoi coat is easy to maintain. Brushing several times a week and bathing regularly will keep the coat clean and assist with flea control.</li><li>Borzois are agile dogs that need adequate fencing in order to keep them safely enclosed, particularly in the city. Similar to other large dogs, Borzois are occasionally prone to ‘bloat’. Consult the breeder of your dog or your vet for additional information. Although this breed is quite capable of undertaking basic obedience training, it is generally not responsive to specialist training.</li><li>Borzois are surprisingly small eaters for their size and only eat about the same amount of food as a medium-sized dog. As well as being fed a high quality balanced diet, a Borzoi enjoys chewing large bones, particularly when left alone for periods of time. The Borzoi coat is easy to maintain. Brushing several times a week and bathing regularly will keep the coat clean and assist with flea control.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.wideopenspaces.com/7-fun-facts-about-the-borzoi-wolfhound/'>wide open SPACES - 7 Fun Facts About the Russian Wolfhound</a> <br> <a href='https://www.pedigree.com.ph/dog-breeds/borzoi#:~:text=Care%20requirements&text=Brushing%20several%20times%20a%20week,be%20exercised%20%27off%20leash%27'>Pedigree - Borzoi Breed - Dog & Puppy Information & Characteristics</a>.</p>"
    },
    {
        "breed": "Shiba Inu",
        "image": "../img/wikiDogs/shibainu.jpg",
        "fun_facts": "<ul><li>The first Shiba Inu brought to the United States arrived with an American armed forces family in 1954. That’s more than 2,150 years after it was born in Japan! The breed’s popularity began to grow and, a little over 20 years later, the first Shiba Inu American litter was born in 1979. It is currently ranked as the 46th most popular dog breed by the American Kennel Club.</li><li>According to the Guinness World Records, one of the world’s oldest-living dogs was a Shiba Inu named Pusuke, who died at age 26 in 2011, three months shy of his 27th birthday. Described as being very active up to his last day, Pusuke passed away five minutes after his owner returned home from a morning walk. The family believes Pusuke waited for her return to take his last breath.</li><li>DNA analysis reveals that the Shiba Inu is one of the oldest dog breeds, dating back to the 3rd century BC, part of the Classical era. During this time, the Roman Republic was dominating the world, the Chinese Terracotta Army was being buried in Emperor Qin Shi Huang’s tomb and, along with the introduction of wet-rice agriculture in Japan, an Asian spitz-type of dog was born.</li></ul>",
        "general_care": "<ul><li>A Shiba will need plenty of mental simulation to avoid boredom. They have the potential for destructive behavior around the home if they become too bored and inactive. Indulge their playful side with toys and games and make sure you exercise their minds as well as their bodies.</li><li>Shiba Inu need between 40 and 60 minutes of exercise every day to satisfy their energetic, active personalities. Make sure this includes plenty of off-lead activity but be careful to do this in a safe, enclosed area. A long, interesting walk with time to explore a secure garden or open space is ideal. But make sure there are no holes in fences or open gates as these dogs are expert escape artists.</li><li>As a highly intelligent breed, Shiba Inus are relatively easy to train. However, their strong-willed nature means that training can sometimes be a challenge as they tend to lose focus and test the boundaries of what they can get away with.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.petinsurance.com/healthzone/pet-breeds/dog-breeds/5-things-you-didnt-know-about-shiba-inus/'>PetHealthZone - 5 Things You Didn't Know About Shiba Inus</a> <br> <a href='https://www.petplan.co.uk/pet-information/dog/breed/shiba-inu/'>Petplan - Shiba Inu</a>.</p>"
    },
    {
        "breed": "Golden retriever",
        "image": "../img/wikiDogs/goldenretriever.jpg",
        "fun_facts": "<ul><li>Goldens can enjoy the companionship of other animals in the home, as long as they have been properly socialized and introduced. They’ve been known to take on the role of “mother” to abandoned puppies and other animals — a Golden named Lilly helped raise three Wild African dogs at the Oklahoma City Zoo.</li><li>When a Golden barks, it can get loud! A Golden from Australia holds the world record for loudest bark at 110 decibels. But while they’ve got a big bark and will let you know when someone’s approaching, they don’t have a big bite. Their love  of people makes them more of a greeter than a guard dog.</li><li>Golden Retrievers are brave and have proved heroic in many situations. Todd, a six-month-old Golden puppy, was awarded Milk Bone’s Dog of the Year award in 2018 for stepping between his owner and a rattlesnake, taking the venomous bite himself.</li><li>Goldens love to fetch! A Golden Retriever named Auggie, of Dallas, Texas, holds the world record for the most tennis balls held in his mouth. He was able to fit 5 regulation-sized tennis balls in his mouth at one time.</li></ul>",
        "general_care": "<ul><li>Golden Retrievers are great with children due to their friendly personality and ability to handle physical interactions. It's important to properly introduce and socialize them with children when they are puppies to ensure success. Always supervise interactions between young children and dogs, and provide your Golden Retriever with a 'safe space' where they can retreat for some quiet time.</li><li>Daily exercise is crucial for Golden Retrievers. They need more than just a daily walk around the block. Playing fetch and swimming (thanks to their webbed toes) are great ways to keep them in shape. Golden Retrievers also make excellent jogging or hiking partners once they are fully grown due to their medium size and high endurance.</li><li>Golden Retrievers should be brushed at least twice a week, ideally daily. They are known to 'blow coat' or shed excessively twice a year, typically in spring and fall, as their coat changes for the seasons. Frequent brushing during these times is essential to prevent matting. Professional grooming is also recommended occasionally for feather trimming and mat prevention. Introducing your Golden Retriever puppy to positive and calm grooming experiences early on will help them enjoy grooming throughout their life.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.trupanion.com/pet-blog/article/golden-retriever'>Trupanion - A Guide to the Golden Retriever Dog Breed</a>.</p>"
    },
    {
        "breed": "Pug",
        "image": "../img/wikiDogs/pug.jpg",
        "fun_facts": "<ul><li>Their Face Wrinkles Are a Badge Of Honor. Pugs have wrinkled faces because Chinese breeders purposely bred them that way. They actually aimed to create a pattern of wrinkles on the dogs’ foreheads, which resembled the Chinese character for “prince.”</li><li>They Aren’t Related to Bulldogs. Pugs are sometimes called “Dutch Bulldogs,” but this is a bit of a misnomer. DNA testing has proven that Bulldogs and Pugs aren’t actually related. The Pug does have the same stocky shape, flat face, and wrinkles as the Bulldog, but Pugs share their origins with the Pekingese, not the Bulldog.</li><li>A Group Of Pugs Is Called a 'Grumble'. As if Pugs couldn’t possibly get more adorable, put them together and they make an adorable grumble.</li><li>They Were Bred to Be Lap Dogs. The original purpose of Pugs was to serve as lap dogs for Chinese emperors. This is why Pugs may not need as much exercise as other breeds.</li></ul>",
        "general_care": "<ul><li>Dogs mouth objects simply to answer the question of ‘What is this?’ and may be tempted to chew on any item within reach. This can lead to accidentally swallowing things, toxic poisoning, or choking.  Proofing the house involves removing small items from the floor, placing cords out of reach or wrapping them in cord protectors, finding new places for shoes and other objects that may be chewed, and placing child-proof locks on any lower cabinets that a Pug may be able to access.</li><li>Pugs are a brachycephalic breed that is very prone to breathing issues. Just about every purebred Pug has some level of stenotic nares (narrowed nostrils) which can make it difficult to breath well and/or elongated palate (soft tissue at the back of the roof of the mouth partially blocks the windpipe). Using a collar when on leash, which places pressure on the trachea, is near guaranteed to exacerbate this. So, part of caring for a Pug involves using accessories that do not impede breathing. For this reason, a harness should be used any time a Pug is on a leash. Harnesses displace tension over the shoulders, back, and chest, leaving the neck free.</li><li>Exercise is crucial for a Pug's overall health and well-being. It benefits their heart and lungs, regulates metabolism, maintains muscle tone, boosts the immune system, and can help prevent diseases like diabetes and certain cancers.  Moreover, exercise is essential for a Pug's mental health. It allows them to release pent-up energy, which can otherwise lead to restlessness. Exercise also facilitates desensitization to various stimuli and promotes socialization with the outside world, which is important for their overall mental stimulation and happiness.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.akc.org/expert-advice/lifestyle/fun-facts-pug/'>AKC - Pug Facts You May Not Know</a> <br> <a href='https://www.petpugdog.com/pug-dog-care-tips'>PetPugDog - Top 15 Pug Dog Care Tips</a>.</p>"
    },
    {
        "breed": "Husky",
        "image": "../img/wikiDogs/husky.jpeg",
        "fun_facts": "<ul><li>Some Believe Siberians Guard the Gates of Heaven. According to Chukchi belief, two Siberians guard the gates of heaven. These guardians turn away anyone who was cruel to a dog during their life on earth.</li><li>Some Believe Siberians Guard the Gates of Heaven. According to Chukchi belief, two Siberians guard the gates of heaven. These guardians turn away anyone who was cruel to a dog during their life on earth.</li><li>An Annual Sled Dog Race Commemorates the Breed. Since 1973, the Iditarod Trail Sled Dog Race has been run annually in commemoration of the Serum Run. Mushers and dog teams travel from Anchorage to Nome in nine to 15 days or more. A range of Northern breeds and crossbreeds participate, and every year a number of all-Siberian Husky teams compete.</li></ul>",
        "general_care": "<ul><li>The Siberian Is Naturally Clean. Siberian Huskies’ dense coats, which protect them against cold weather, don’t require any clipping or trimming. The coat does have a shedding period at least once a year, but the shedding can be kept under control with frequent brushing during that time.</li><li>Bored Siberian Huskies have a reputation for being destructive indoors, digging holes outside, and escaping yards to run freely. It’s important to provide your Husky dog with lots of mental stimulation and activity or they will likely look elsewhere for entertainment.</li><li>Training should start when your Siberian Husky is a puppy to correct unwanted behaviors before they become adults. Huskies need to be leash trained so they don’t run off to explore on their own. They also need to be trained to avoid excessive barking and howling.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.akc.org/expert-advice/lifestyle/fun-facts-siberian-husky/'>AKC - Siberian Husky Facts You May Not Know</a> <br> <a href='https://www.petmd.com/dog/breeds/siberian-husky'>PetMD - Siberian Husky</a>.</p>"
    },
    {
        "breed": "Corgi",
        "image": "../img/wikiDogs/corgi.jpg",
        "fun_facts": "<ul><li>The Pembroke Welsh Corgi is known as one of the most agreeable small house dogs and is a loyal, loving pet for families. They also are known for their intelligence and enthusiasm for working. Many Pembrokes compete in dog sports, such as agility, herding, conformation, obedience, and more.</li><li>Don’t let their size fool you, these dogs have been herding for decades! From the beginning, the Welsh used Pembroke Welsh Corgis as herding dogs, family companions, and guardians of the farm. Even today, these dogs are still expert herders. Many Pembrokes even compete in AKC Herding competitions.</li><li>According to the Pembroke Welsh Corgi Club of America, the Pembroke Welsh Corgi's ancestry dates back to at least the 10th century. However, it's unclear whether they descended from Swedish Vallhunds brought to Pembrokeshire by Vikings or from the ancestors of today's Schipperkes and Pomeranians, which were brought to Wales by Flemish weavers.</li></ul>",
        "general_care": "<ul><li>Corgis have a thick, weatherproof coat, a soft, light undercoat and a coarse outer coat. They  need regular grooming, more than once a week , especially in late spring or early summer. Baths can help loosen the dead hairs during shedding season, but your pup needs to be completely dry before brushing starts.</li><li>Due to their small size, Corgis can thrive in any home as long as they have a small garden or yard to enjoy. Despite their appearance, Pembrokes are athletic and require daily exercise. Owners should avoid exposing them to extreme temperatures and ensure they have plenty of fresh water after exercise. Without enough exercise or if left alone for long periods, Corgis may resort to excessive barking, chewing, or digging.</li><li>Pembrokes do well with a minimal amount of food. In general, they need to eat  up to 3/4 cup of dry dog food twice a day . Some are prone to getting overweight, which can put extra strain on their long, low backs. For this reason, owners should keep an eye on their Corgi’s calorie intake and avoid free-feeding. Exercise is a must to keep the weight under control.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.akc.org/expert-advice/lifestyle/fun-facts-about-the-pembroke-welsh-corgi/'>AKC - 8 Fun Facts About the Pembroke Welsh Corgi</a> <br> <a href='https://www.pawlicy.com/blog/corgi-dog-breed/'>Corgi Breed Guide: History, Characteristics & Care Tips</a>.</p>"
    },
    {
        "breed": "Chihuahua",
        "image": "../img/wikiDogs/chihuahua.jpg",
        "fun_facts": "<ul><li>The name Chihuahua is derived from the local Mexican language of Nahuatl, meaning a place between two waters. The city itself is likely to have been established by silver and gold hunters panning the rivers. But to us dog lovers, it only has one meaning – adorable, feisty little dog breed.</li><li>There are officially two Chihuahua breeds, the long and smooth-coated. Having been established as one breed in 1904, the American Kennel Club split it into two breeds in 1952.</li><li>Chihuahuas may be diminutive but they are fiercely loyal and protective. If you have an intruder crossing a Chihuahua’s threshold, they’ll certainly know about it – as will the rest of their household. They are vocal and animated and despite their stature never see themselves as the underdog.</li><li>Perhaps it’s the terrier instinct, or their desire to conserve heat, but Chihuahuas typically love to burrow into a cozy place to sleep. It may also hark back to their status in the wild as such a small dog could be a target for predators, so this enabled them to hide from larger animals.</li></ul>",
        "general_care": "<ul><li>Chihuahuas are very intelligent and highly alert dogs. They want to please and respond well to positive training practices. However, they can also seek to dominate their owners and be somewhat temperamental, so you’ll need to make it clear who’s in charge from the very beginning with consistent training and appropriate boundaries.</li><li>Due to their small size, Chihuahuas are perfect for students and people living in smaller homes or apartments. They’re also ideal for those who don't like taking their pet out on cold days since these dogs can be easily taught to use a wee wee pad or litter box indoors. However, when you do take your Chi out, avoid leaving them alone or unattended for long periods of time as their small size makes them a potential target for attacks by larger dogs or wildlife.</li><li>Due to their small size, Chihuahuas usually need up to 1/2 cup of dry dog food a day. However, your dog’s exact food intake will be based on their age, size, and activity level. You should always consult with your veterinarian to make sure you are providing optimal nutrition to meet your Chihuahua’s dietary needs. Be sure to keep an eye on your dog’s daily food intake in order to prevent them from getting overweight.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.petsradar.com/feature/32-fun-facts-about-chihuahuas'>Pets Radar - 32 fun facts about Chihuahuas</a> <br> <a href='https://www.pawlicy.com/blog/chihuahua-dog-breed/'>Pawlicy Adviser - Chihuahua Breed Guide: Characteristics, History & Care</a>.</p>"
    },
    {
        "breed": "Dalmatian",
        "image": "../img/wikiDogs/dalmatian.jpg",
        "fun_facts": "<ul><li>They have no spots at birth. That’s right! Dalmatian puppies don’t have any spots when they’re born. Instead, they are born all white and get spots as they get older. Their spots start to develop around 2 to 3 weeks old. By the time dalmatian puppies are 4 weeks old, most of their spots will be present, but they will continue to slowly develop spots as they grow and throughout the rest of their lives.</li><li>They have served many different roles. Because of their versatility, dalmations have served many different purposes throughout the years. During times of war, they served as sentinels at the Dalmatia and Croatia borders. They’ve also been used for performing in circuses, herding, hunting, coaching, and ratting.</li><li>They were the only dog breed bred to be a coach dog. They would run alongside carriages, protecting the horses from stray dogs and keeping the horses calm. They also acted as a guard dog, providing security at stops and alerting the driver of any approaching dangers.</li></ul>",
        "general_care": "<ul><li>It’s not uncommon for Dalmatians to be deaf. According to the Universities Federation for Animal Welfare, 5% of Dalmatians are totally deaf, and another 15%-30% are deaf in one ear. Deaf dogs will need special training and living considerations, such as using hand signals in place of voice commands.</li><li>While Dalmatians are friendly and loving toward people they know, they can be aloof and uninterested when meeting new people, especially in adulthood. This is why socializing Dalmatian puppies early in life is so important.</li><li>Dalmatians are independent and headstrong, so training them is a practice in patience. They respond best to positive reinforcement training, so give them lots of praise with healthy treats, toys, and head pats. But these pups are super smart, too, and can pick up on training cues quickly when properly motivated.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://goldcountrymedia.com/news/176399/fun-facts-about-dalmatians/'>Gold Country Media - Fun facts about dalmatians</a></p>"
    },
    {
        "breed": "Beagle",
        "image": "../img/wikiDogs/beagle.jpg",
        "fun_facts": "<ul><li>In the U.S., Beagles are classified in one of two ways in terms of size. There are Beagles under 13 inches and those over 13 inches but at or under 15 inches. The height limit of a Beagle in the U.S. is 15 inches. In England, however, it is 16 inches.</li><li>Many Beagles have white-tipped tails. This white tip was bred into Beagles so that they would be visible when they had their noses to the ground during a hunt.</li><li>You may not initially think that Charlie Brown’s beloved pet is a Beagle, but in fact, he is an AKC-registered Beagle.</li><li>The name “Beagle” is thought to come from the French word “begueule,” meaning “gaped throat,” and Beagles can definitely live up to that namesake. The Beagle is one of the most vocal dog breeds. They can make three different sounds—a standard bark, a yodel-like sound called a bay (which they use when hunting), and a howl.</li><li>Beagles are excellent dogs for hunting rabbits and hares. They have a phenomenal sense of smell and seemingly endless stamina. When fox hunting became popular, breeders created the Foxhound by crossing a Beagle with a Buckhound.</li></ul>",
        "general_care": "<ul><li>Beagle puppies need to eat more frequently than adult dogs (up to four meals per day) to prevent hypoglycemia. It’s important to feed your dog based on their life stage—puppies need puppy-formulated food, adults need adult-formulated food, and senior dogs need senior-formulated food.</li><li>Beagles are smart, but they but can also have a short attention span when it comes to training. Because they are food-motivated, most Beagles train best before mealtime and will do just about anything for treats.</li><li>Potty training can be especially difficult with Beagles. Because of their powerful nose, they can easily smell where a part of the house was previously soiled and be prompted to pee there themself. Repetition, consistency, and positive reinforcement work best to help potty train Beagle puppies.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.akc.org/expert-advice/lifestyle/things-you-didnt-know-beagle/'>AKC - 10 Fun Facts About the Beagle</a> <br> <a href='https://www.petmd.com/dog/breeds/beagle'>PetMD - Beagle</a>.</p>"
    },
    {
        "breed": "Yorkshire",
        "image": "../img/wikiDogs/yorkshire.jpg",
        "fun_facts": "<ul><li>Originally bred to catch rats in mills, Yorkshire Terriers are dogs with a hunting instinct, drive and determination. Famous for being determined little creatures, they make great pets for those both living alone and families with older children. As well as this, they are famous for making great bonds with their owners and are also considered great apartment dogs due to their small size.</li><li>Yorkies do not shed, so that means they depend on their owners to keep their hair in check. Left unattended, their hair will keep growing, just like a human’s would—in fact, Yorkshire terrier hair can grow to be two feet long. While show dogs tend to have longer hair, most casual owners keep their dog’s hair short to keep them from tripping or getting food stuck in it. This shaggy look is often called “the puppy cut.”</li><li>Yorkshire terriers are especially prone to pharyngeal gag reflex, or reverse sneezing. Instead of pushing air out of the nose like a normal sneeze, dogs will gasp for air, making a honking sound like a goose. While somewhat alarming to witness, these noises are ultimately harmless and pass after a few minutes. Usually, they’re brought on by irritants like pollen, dust, cleaners, and perfumes.</li></ul>",
        "general_care": "<ul><li>Yorkies are known for being vocal dogs and enjoy ensuring owners can hear their voice. Whether it's someone at the door or an unfamiliar noise, they have a lot to say and will bark at a variety of noises. Proper training will help to control any bad barking habits, especially with young puppies.</li><li>Yorkies love their owners, and are very intelligent and eager to please. Offering effusive praise and treats for good behavior will work far better with the Yorkie than harsh corrections. Starting from an early age, the Yorkie should be socialized to strange situations, people, and other dogs. Take him into new situations slowly, and always in a calm and happy atmosphere. These should be positive experiences. Despite their small size, Yorkies can participate in and excel at canine activities such as rally, agility and obedience, and many Yorkies serve with their human partners in roles such as therapy work.</li><li>The Yorkshire Terrier's coat is very similar to human hair and should be treated accordingly. If the coat is kept long, it needs to be brushed daily. To avoid eye irritation, the hair on the upper part of the head should be trimmed short or pulled up into a topknot. The Yorkie will need a bath every week or so. Check the ears weekly for any debris or signs of infection.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.mentalfloss.com/article/68452/10-tiny-facts-about-yorkshire-terriers'>Mental Floss - 10 Facts About Yorkshire Terriers</a> <br> <a href='https://www.akc.org/dog-breeds/yorkshire-terrier/'>AKC - Yorkshire Terrier</a>.</p>"
    },
    {
        "breed": "Pomeranian",
        "image": "../img/wikiDogs/pomeranian.jpeg",
        "fun_facts": "<ul><li>Pomeranians come in many colors and patterns, including black dogs with tan markings or piebald patterns. The most popular color for a show Pomeranian is orange or orange sable. Other Pomeranian colors are cream, cream sable, black, black and tan, white, wolf sable, brown, blue, and beaver, and the Pom dog patterns include tan markings, parti-color, brindle, and merle.</li><li>Poms were actually larger until Queen Victoria had a say in their development. The Queen of England fell in love with Pomeranians when they weighed around 20 to 30 pounds. She bred them to be smaller until we got tiny 3- to 7-pound Poms that we’re familiar with today.</li><li>Dogs rarely give birth to twins, but Pomeranians are among those breeds more prone to the phenomenon. How it works is that each puppy has their own embryonic sac but shares one umbilical cord. However, they aren’t usually identical twins and tend to be different colors.</li><li>Poms are known for their adorable smiles. This is likely a trait that they inherited from their Spitz heritage. Many Spitz breeds, most notably the Samoyed, will “smile” because this trait prevents icicles from forming on their mouths in frigid weather.</li></ul>",
        "general_care": "<ul><li>Like all small dogs, Pomeranians tend to be yappy if not trained to behave. Poms have been known to be challenging and even more vocal than other dogs. They make great apartment pets, but if you live in an area with close neighbors, you might need to ensure your dog is trained not to bark.</li><li>This small, furry dog is playful but doesn’t need as much exercise or a long walk to stay happy. They are great pets for people who live in apartments or those without a fenced yard. If you can provide them with enough mental stimulation, they’ll be content just playing indoors and won’t become restless or destructive.</li><li>Pomeranians are intelligent dogs, enjoy many dog sports, and can learn tricks quickly. They’re also quick to sound the alarm when someone’s at the door or in the yard, which makes them good watchdogs.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://pomeranian.org/facts-all-about-pomeranian-dogs/'>Pomeranian - Fun Facts About Pomeranians – Learning Made Easy</a></p>"
    },
    {
        "breed": "Labrador",
        "image": "../img/wikiDogs/labrador.jpg",
        "fun_facts": "<ul><li>Labs were bred to be the ideal water dogs. Fishermen used them to bring in nets and retrieve fish. They can remain in the water for hours, even if it’s icy cold. They have a thick double-layer coat that keeps them warm and have webbed toes and a thick tail that works like a rudder.</li><li>You may have noticed how fast they are because of their energy and playfulness but their speed actually goes beyond that. They can hit 12 miles an hour in just three seconds!</li><li>While other breeds of dogs are known to mature by the time they are two years old, Labs like holding on to their puppy-like nature for a lot longer and usually don’t hit maturity until they turn four</li><li>A single litter can include brown, black and yellow puppies despite what their parents’ color might be.</li></ul>",
        "general_care": "<ul><li>Labrador Retrievers do best with twice-daily feedings, morning and evening. They love to eat and are known to eat very quickly. If you notice your dog gobbling food down, consider a slow-feeding device. This will regulate the amount of food your dog can eat at one time and prevent regurgitation and stomach upset that can happen if they eat too quickly.</li><li>It is highly recommended that Labrador Retriever puppies participate in puppy training and obedience training classes. They need to be socialized with different people and pets, so they get used to being around others at a young age.</li><li>Labrador Retrievers don’t require a lot of grooming, but they do shed a lot. Deshedding and brushing will be important parts of your daily, weekly, and monthly grooming care routines.</li></ul>",
        "sources": "<p>For more information, visit <br> <a href='https://www.bayshorelovespets.com/10-Fun-Facts-About-Labrador-Retrievers-From-Your-Ormond-Beach-Vet-1-12025.html'>Bayshore Animal Hospital - 10 FUN FACTS ABOUT LABRADOR RETRIEVERS FROM YOUR ORMOND BEACH VET</a> <br> <a href='https://www.petmd.com/dog/breeds/labrador-retriever'>PetMD - Labrador Retriever</a>.</p>"
    }
]
